VGH/src/ExchangePlans/ОбменсМаркетПлейсом/ОбменсМаркетПлейсом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="af6d4d64-e14b-455b-b428-2f14d9304d07">
  <name>ОбменсМаркетПлейсом</name>
  <attributes>
    <name>АдресСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СайтПодключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

VGH/src/ExchangePlans/ОбменсМаркетПлейсом/ManagerModule.bsl
Функция ПолучитьПараметрыАктивногоСайта()  Экспорт
Параметры=Новый Структура("Наименование,HTTPСервер,ИмяПользователя,Пароль,GUID,Порт");
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ОбменсМаркетПлейсом.Ссылка КАК Ссылка,
|	ОбменсМаркетПлейсом.Наименование КАК Наименование,
|	ОбменсМаркетПлейсом.АдресСайта КАК HTTPСервер,
|	ОбменсМаркетПлейсом.ИмяПользователя КАК ИмяПользователя,
|	ОбменсМаркетПлейсом.Пароль КАК Пароль,
|	ОбменсМаркетПлейсом.Токен КАК GUID,
|	ОбменсМаркетПлейсом.СайтПодключен КАК СайтПодключен,
|	0 КАК Порт
|ИЗ
|	ПланОбмена.ОбменсМаркетПлейсом КАК ОбменсМаркетПлейсом
|ГДЕ
|	ОбменсМаркетПлейсом.СайтПодключен
|	И НЕ ОбменсМаркетПлейсом.ПометкаУдаления";

РезультатЗапроса = Запрос.Выполнить();
Если РезультатЗапроса.Пустой() Тогда
	Возврат Параметры;
КонецЕсли; 
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
	ЗаполнитьЗначенияСвойств(Параметры,Выборка);
	Параметры.Вставить("Пароль",ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Выборка.Ссылка, "Пароль"));
	Прервать;
КонецЦикла;
Возврат Параметры;	

	
КонецФункции
